conf/Catalogs/УчетныеДанные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>УчетныеДанные</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИнформационнаяБаза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеБазы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

conf/CommonModules/ИнформационныеБазыСлужебный/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Процедура УдалитьЭлемент(Ссылка) Экспорт
	ИБОбъект = Ссылка.ПолучитьОбъект();
	ИБОбъект.Удалить();
КонецПроцедуры

Функция УчетныеДанные(ИнформационнаяБаза) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УчетныеДанные.Наименование КАК Наименование,
	|	УчетныеДанные.Логин КАК Логин,
	|	УчетныеДанные.Пароль КАК Пароль
	|ИЗ
	|	Справочник.УчетныеДанные КАК УчетныеДанные
	|ГДЕ
	|	(УчетныеДанные.ИнформационнаяБаза = &ИнформационнаяБаза
	|			ИЛИ УчетныеДанные.ИнформационнаяБаза = ЗНАЧЕНИЕ(Справочник.ИнформационныеБазы.ПустаяСсылка))";
	
	Запрос.УстановитьПараметр("ИнформационнаяБаза", ИнформационнаяБаза);
	
	ВыполненныйЗапрос = Запрос.Выполнить();
	
	Если ВыполненныйЗапрос.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	УчетныеДанные = Новый Массив;
	
	Выборка = ВыполненныйЗапрос.Выбрать();
	Пока Выборка.Следующий() Цикл
		ДанныеУчетнойЗаписи = Новый Структура;
		ДанныеУчетнойЗаписи.Вставить("Наименование", Выборка.Наименование);
		ДанныеУчетнойЗаписи.Вставить("Логин", Выборка.Логин);
		ДанныеУчетнойЗаписи.Вставить("Пароль", Выборка.Пароль);
		
		УчетныеДанные.Добавить(ДанныеУчетнойЗаписи);
	КонецЦикла;
	
	Возврат УчетныеДанные;
КонецФункции

#КонецОбласти
